Masmiseim36/nxpSDK/boards/hvpke18f/demo_apps/mc_acim/pin_mux.h
/*
 * Copyright 2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2019 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/*! @name PORTB12 (number 68), MB_J11[A14]/MB_U12[18]/MB_PWM_AT/J4[A14]/PWM0
  @{ */
#define MB_PWM_AT_PORT PORTB /*!<@brief PORT device name: PORTB */
#define MB_PWM_AT_PIN 12U    /*!<@brief PORTB pin index: 12 */
                             /* @} */

/*! @name PORTB13 (number 67), MB_J11[A15]/MB_U12[12]/MB_PWM_AB/J4[A15]/PWM1
  @{ */
#define MB_PWM_AB_PORT PORTB /*!<@brief PORT device name: PORTB */
#define MB_PWM_AB_PIN 13U    /*!<@brief PORTB pin index: 13 */
                             /* @} */

/*! @name PORTB14 (number 66), MB_J11[A16]/MB_U12[19]/MB_PWM_BT/J4[A16]/PWM2
  @{ */
#define MB_PWM_BT_PORT PORTB /*!<@brief PORT device name: PORTB */
#define MB_PWM_BT_PIN 14U    /*!<@brief PORTB pin index: 14 */
                             /* @} */

/*! @name PORTB15 (number 65), MB_J11[A17]/MB_U12[13]/MB_PWM_BB/J4[A17]/PWM3
  @{ */
#define MB_PWM_BB_PORT PORTB /*!<@brief PORT device name: PORTB */
#define MB_PWM_BB_PIN 15U    /*!<@brief PORTB pin index: 15 */
                             /* @} */

/*! @name PORTB16 (number 64), MB_J11[A18]/MB_U12[20]/MB_PWM_CT/J4[A18]/PWM4
  @{ */
#define MB_PWM_CT_PORT PORTB /*!<@brief PORT device name: PORTB */
#define MB_PWM_CT_PIN 16U    /*!<@brief PORTB pin index: 16 */
                             /* @} */

/*! @name PORTB17 (number 63), MB_J11[A19]/MB_U12[14]/MB_PWM_CB/J4[A19]/PWM5
  @{ */
#define MB_PWM_CB_PORT PORTB /*!<@brief PORT device name: PORTB */
#define MB_PWM_CB_PIN 17U    /*!<@brief PORTB pin index: 17 */
                             /* @} */

/*! @name PORTE3 (number 18), MB_J11[A25]/MB_U12[11]/MB_TP28/MB_FAULT/MB_FAULT_1/MB_PFC_overcurrent/J4[A25]/FAULT_1
  @{ */
#define MB_FAULT_1_PORT PORTE /*!<@brief PORT device name: PORTE */
#define MB_FAULT_1_PIN 3U     /*!<@brief PORTE pin index: 3 */
                              /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void MB_InitMC_PWMPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void MB_InitPFCPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void MB_InitANA_SENSPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void MB_InitBEMFPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void MB_InitENCPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void MB_InitUSB_UARTPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void MB_InitEXT_UARTPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void MB_InitBRAKEPins(void);

#define ADCOPT_ADC0PRETRGSEL_PDB 0x00u /*!<@brief ADC0 pre-trigger source select: PDB pre-trigger (default) */
#define ADCOPT_ADC0TRGSEL_PDB 0x00u    /*!<@brief ADC0 trigger source select: PDB output */
#define ADCOPT_ADC1TRGSEL_PDB 0x00u    /*!<@brief ADC1 trigger source select: PDB output */

/*! @name PORTE2 (number 85), MB_J11[B28]/MB_Q3[1]/MB_Relay/J4[B28]/Relay
  @{ */
#define MB_RELAY_GPIO GPIOE /*!<@brief GPIO device name: GPIOE */
#define MB_RELAY_PORT PORTE /*!<@brief PORT device name: PORTE */
#define MB_RELAY_PIN 2U     /*!<@brief PORTE pin index: 2 */
                            /* @} */

/*! @name PORTE6 (number 84), MB_J11[B20]/MB_U9[4]/MB_USER_LED/J4[B20]/USER_LED
  @{ */
#define MB_LED_GREEN_GPIO GPIOE /*!<@brief GPIO device name: GPIOE */
#define MB_LED_GREEN_PORT PORTE /*!<@brief PORT device name: PORTE */
#define MB_LED_GREEN_PIN 6U     /*!<@brief PORTE pin index: 6 */
                                /* @} */

/*! @name PORTE8 (number 26), MB_J11[B25]/MB_U9[2]/MB_TP_35/MB_MCU_BRAKE/J4[B25]/MCU_BRAKE
  @{ */
#define MB_MCU_BRAKE_GPIO GPIOE /*!<@brief GPIO device name: GPIOE */
#define MB_MCU_BRAKE_PORT PORTE /*!<@brief PORT device name: PORTE */
#define MB_MCU_BRAKE_PIN 8U     /*!<@brief PORTE pin index: 8 */
                                /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void MB_InitMISCPins(void);

/*! @name PORTE12 (number 19), U2[24]/U6[13]/TxD_sda
  @{ */
#define BOARD_UART_TX_TGTMCU_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_UART_TX_TGTMCU_PIN 12U    /*!<@brief PORTE pin index: 12 */
                                        /* @} */

/*! @name PORTD17 (number 20), U2[25]/U6[14]/RxD_sda
  @{ */
#define BOARD_UART_RX_TGTMCU_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_UART_RX_TGTMCU_PIN 17U    /*!<@brief PORTD pin index: 17 */
                                        /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UARTPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLEDsPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
